import re  # Імпортуємо модуль re для використання регулярних виразів

def normalize(name):
    # Функція, що нормалізує ім'я, замінюючи кирилицю на латиницю та видаляючи зайві символи
    # Приймає аргумент "name" - рядок, який потрібно нормалізувати

    translit_dict = {
        'а': 'a', 'б': 'b', 'в': 'v', 'г': 'h', 'ґ': 'g',
        'д': 'd', 'е': 'e', 'є': 'ye', 'ж': 'zh', 'з': 'z',
        'и': 'y', 'і': 'i', 'ї': 'i', 'й': 'i', 'к': 'k',
        'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p',
        'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f',
        'х': 'kh', 'ц': 'ts', 'ч': 'ch', 'ш': 'sh', 'щ': 'shch',
        'ь': '', 'ю': 'iu', 'я': 'ia', 'А': 'A', 'Б': 'B',
        'В': 'V', 'Г': 'H', 'Ґ': 'G', 'Д': 'D', 'Е': 'E',
        'Є': 'Ye', 'Ж': 'Zh', 'З': 'Z', 'И': 'Y', 'І': 'I',
        'Ї': 'I', 'Й': 'I', 'К': 'K', 'Л': 'L', 'М': 'M',
        'Н': 'N', 'О': 'O', 'П': 'P', 'Р': 'R', 'С': 'S',
        'Т': 'T', 'У': 'U', 'Ф': 'F', 'Х': 'Kh', 'Ц': 'Ts',
        'Ч': 'Ch', 'Ш': 'Sh', 'Щ': 'Shch', 'Ь': '', 'Ю': 'Iu',
        'Я': 'Ya'
    }

    translation_table = str.maketrans(translit_dict)  # Створюємо таблицю замін для функції translate()
    name = name.translate(translation_table)  # Замінюємо символи кирилиці на латиницю

    name = re.sub(r'[^A-Za-z0-9.]+', '_', name)
    # Використовуємо регулярний вираз для заміни всіх символів,
    # які не є літерами латиниці, цифрами або крапкою, на підкреслення

    return name  # Повертаємо нормалізоване ім'я
