import os  # Імпортуємо модуль os для взаємодії з операційною системою

def remove_empty_folders(folder):
    # Функція, що видаляє порожні папки
    # Приймає аргумент "folder" - шлях до папки

    for root, dirs, files in os.walk(folder, topdown=False):
        # Цикл, що проходить через всі папки та файли у вказаній папці та її підпапках
        # Використовується функція os.walk() для отримання списку папок та файлів

        for dir in dirs:
            # Цикл, що проходить через кожну підпапку у списку підпапок

            dir_path = os.path.join(root, dir)
            # Об'єднуємо шлях батьківської папки (root) з назвою підпапки (dir)
            # за допомогою функції os.path.join()
            # Отримуємо повний шлях до підпапки

            if not os.listdir(dir_path):
                # Перевіряємо, чи папка порожня
                # Викликаємо функцію os.listdir(), яка повертає список файлів та папок у заданій папці
                # Умова "not os.listdir(dir_path)" перевіряє, чи список порожній

                os.rmdir(dir_path)
                # Видаляємо порожню папку за допомогою функції os.rmdir()
                # Якщо папка містить файли або підпапки, цей рядок коду не буде виконаний
